/*
ex5-12	４人の学生の３科目のテスト２回分の合計を求めて表示
	◎の部分を埋めて。完成せよ
*/

#include <stdio.h>

int main(void)
{
	int i, j, k;
	int tensu[2][4][3] = { { {91, 63, 78}, {67, 72, 46}, {89, 34, 53}, {32, 54, 34} },   //1回目の4人分の3科目の点数
    { {97, 67, 82}, {73, 43, 46}, {97, 56, 21}, {85, 46, 35} } };   //2回目の4人分の3科目の点数  
	int sum[4][3] = { 0 };			/* 1回目と2回目の合計 */

	/* ２回分の点数の合計を求める */
	for (k = 0; k < 2; k++){
	for (i = 0; i < 4; i++) {							/* ４人分の */
		for (j = 0; j < 3; j++) {						/* ３科目の */
			sum[i][j] += tensu[k][i][j];

		}/*◎ ２回分を加算 */
	}}

	/* １回目の点数を表示 */
	for (k = 0; k < 2; k++){
		printf("%d回目の点数\n", k + 1);
	 for (i = 0; i < 4; i++) {
		for (j = 0; j < 3; j++)
			printf("%4d", tensu[k][i][j]);
		putchar('\n');
	}}

	/* ２回目の点数を表示 
	puts("２回目の点数");
	for (i = 0; i < 4; i++) {
		for (j = 0; j < 3; j++)
			printf("%4d", tensu2[i][j]);     //◎  tensu1[i][j]の表示   //◎  tensu2[i][j]の表示
		putchar('\n');
	}*/

	/* 合計点を表示 */
	puts("合計点");
	for (i = 0; i < 4; i++) {
		for (j = 0; j < 3; j++)
			printf("%4d", sum[i][j]);     //◎  sum[i][j]の表示
		putchar('\n');
	}
	return 0;
}